# Homebrew Cask Fonts
tap "homebrew/cask-fonts"
cask "font-fira-code"

# Homebrew Packages
brew "mas"

# Terminal Tools
brew "vim"
brew "zsh"
brew "pure"
brew "tmux"
brew "zsh-syntax-highlighting"

# Terminal Trend Tools
brew "z"
brew "jq"
brew "fzf"
brew "bat"
brew "exa"
cask "fig"

# Developer Tools
brew "git"
brew "htop"
cask "iterm2"
cask "notion"
cask "docker"
cask "visual-studio-code"
cask "devtoys"
cask "dbeaver-community"
mas "RunCat", id: 1429033973
mas "ColorSlurp", id: 1287239339

# App Development
cask "android-studio"
cask "xcodes"
cask "flutter"

# Apps
## Cask Apps
cask "rectangle"
cask "google-chrome"
cask "android-file-transfer"

## Personal App
cask "telegram"
mas "KakaoTalk", id: 869223134

# VScode extentions
## Git
vscode "mhutchie.git-graph"
vscode "seatonjiang.gitmoji-vscode"
## Terminal
vscode "withfig.fig"
## Lint, Style
vscode "redhat.vscode-yaml"
vscode "PKief.material-icon-theme"
vscode "EditorConfig.EditorConfig"
## CSS
vscode "bradlc.vscode-tailwindcss"
vscode "csstools.postcss"
## JS, Typescript
vscode "Prisma.prisma"
vscode "dbaeumer.vscode-eslint"
vscode "wix.vscode-import-cost"
vscode "pflannery.vscode-versionlens"
vscode "mgmcdermott.vscode-language-babel"
vscode "OfHumanBondage.react-proptypes-intellisense"
## GraphQL
vscode "GraphQL.vscode-graphql"
vscode "GraphQL.vscode-graphql-syntax"
## Docker
vscode "ms-azuretools.vscode-docker"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"