# paths
cask_args appdir: "~/Applications"

tap "homebrew/core"
tap "homebrew/cask"
brew "mas"

# terminal
brew "vim"
brew "zsh"
brew "pure"
brew "tmux"
cask "hyper"
brew "zsh-completions"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# terminal - trend
brew "z"
brew "jq"
brew "fzf"
brew "bat"
brew "exa"
brew "dust"
brew "hexyl"

# development
brew "git"
brew "htop"
brew "nvm"
brew "pyenv"
cask "notion"
cask "docker"
cask "gitkraken"
cask "visual-studio-code"

# setup - react-native
brew "watchman"
brew "react-native-cli"
cask "android-studio"

# apps - cask
cask "slack"
cask "rectangle"
cask "sequel-pro"
cask "google-chrome"
cask "android-file-transfer"

# TODO: app - microsofts
# cask "microsoft-auto-update"
# cask "microsoft-excel"
# cask "microsoft-outlook"
# cask "microsoft-powerpoint"
# cask "microsoft-teams"
# cask "microsoft-word"
# mas "Microsoft OneNote", id: 784801555
# mas "Microsoft To Do", id: 1274495053

# app - personal
cask "zoom"
cask "steam"
cask "kindle"
cask "discord"
mas "Allkdic", id: 1033453958
mas "KakaoTalk", id: 869223134
