# Homebrew taps - Add external repositories for installing packages
tap "homebrew/bundle"       # Allows management of packages via Brewfile
tap "supabase/tap"          # Supabase CLI and tools tap

# Install fonts
cask "font-fira-code"       # Install Fira Code font, known for ligatures useful in programming

# Homebrew Packages
brew "mas"                  # Mac App Store command-line interface for installing and managing Mac App Store apps

# Terminal Tools
brew "vim"                  # Install Vim, a highly configurable text editor for efficiently writing code
brew "zsh"                  # Z shell, a powerful shell that is an improvement over Bash
brew "tmux"                 # Terminal multiplexer, allows managing multiple terminal sessions in one window
brew "starship"             # Cross-shell prompt with customization options (replacing pure)
brew "zsh-syntax-highlighting" # Zsh plugin to highlight valid commands for better terminal experience

# Terminal Trend Tools - Enhancing terminal experience with modern tools
brew "z"                    # Tracks the most visited directories and allows quick navigation
brew "jq"                   # Command-line JSON processor for manipulating JSON data
brew "lsd"                  # Modern replacement for 'ls', with colors and icons for file types
brew "fzf"                  # Fuzzy finder for file searching and more in the terminal
brew "bat"                  # Cat command replacement with syntax highlighting and git integration
brew "exa"                  # Another 'ls' replacement that provides more features and better presentation

# Developer Tools
brew "git"                  # Version control system for tracking code changes and collaborating
brew "nvm"                  # Node Version Manager for managing multiple versions of Node.js
cask "warp"                 # Warp terminal, a modern terminal reimagined with GPU acceleration and other features
cask "ngrok"                # Expose local servers to the internet via secure tunnels
cask "notion"               # Notion, a note-taking and productivity app
cask "docker"               # Docker desktop for running containerized applications
brew "awscli"               # Amazon Web Services command-line interface for managing cloud resources
cask "raycast"              # Raycast, a productivity tool for quick access to apps and commands
brew "glances"              # A cross-platform system monitoring tool with advanced features (better than htop)
# cask "dbeaver-community"  # Uncomment if a GUI database manager is needed
cask "visual-studio-code"   # Code editor with a wide range of extensions for development

# App Development - Tools for mobile and web development
cask "xcodes"               # Manage multiple versions of Xcode easily
cask "flutter"              # Google’s UI toolkit for building natively compiled apps for mobile, web, and desktop
brew "fastlane"             # Automate app deployment for iOS and Android
brew "cocoapods"            # Dependency manager for Swift and Objective-C projects
tap "dart-lang/dart"        # Dart language tap for managing versions of Dart
cask "android-studio"       # IDE for Android development
brew "dart-lang/dart/dart"  # Dart SDK for Flutter and web development

# Apps - Utilities and personal tools
## Cask Apps
cask "steam"                # Steam, the gaming platform for PC games
cask "figma"                # Figma, a design tool for UI/UX work
cask "alt-tab"              # Alt-Tab, an app to switch between windows like on Windows OS
cask "discord"              # Discord, a communication tool for voice, video, and text
cask "google-chrome"        # Google Chrome, a web browser
cask "android-file-transfer" # Tool for transferring files between Android devices and Mac

## Personal Apps
cask "kindle"               # Kindle app for reading ebooks
cask "telegram"             # Telegram messaging app
mas "Vimari", id: 1480933944  # Vimari, extension for Safari to add Vim keybindings
mas "KakaoTalk", id: 869223134 # KakaoTalk, a popular messaging app in Korea
mas "Save to Notion", id: 6478488868 # Mac app to save content from the web directly to Notion

# Visual Studio Code Extensions - Extensions for improving the coding experience
## Git
vscode "mhutchie.git-graph"   # Git graph to visualize commit history
vscode "seatonjiang.gitmoji-vscode" # Gitmoji extension for using emoji in commit messages

## CSS
vscode "bradlc.vscode-tailwindcss" # Tailwind CSS IntelliSense, provides autocomplete for Tailwind
vscode "csstools.postcss"     # PostCSS language support for improved CSS processing

## GraphQL
vscode "GraphQL.vscode-graphql" # GraphQL support with syntax highlighting and more

## Dart
vscode "Dart-Code.dart-code"  # Dart language support
vscode "dart-code.flutter"    # Flutter development tools

## Theme
vscode "loilo.snazzy-light"   # Snazzy Light theme for VSCode
vscode "aaronthomas.vscode-snazzy-operator" # Snazzy Operator theme for VSCode

